cask_args appdir: '/Applications'

# Prerequisites for some of the apps
tap 'homebrew/bundle'
tap 'koekeishiya/formulae'
tap 'cpe/tools', 'https://gitlab-tools.swacorp.com/cpe/homebrew-cpe-tools.git'
brew 'openjdk@17'
cask 'xquartz'

# Stuff
brew 'asciidoctor'
brew 'awscli'

brew 'cmake'
brew 'coreutils'
## brew 'docker'
brew 'ffmpeg'
brew 'flac'
brew 'freetype'
brew 'gh'
brew 'gpg'
brew 'graphviz'
brew 'grc'
brew 'highlight'
brew 'htop'
brew 'hub'
brew 'icu4c'
## brew 'imagemagick'
brew 'jp2a'
brew 'jpeg'
brew 'jq'
brew 'less'
brew 'libplist'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libusb'
brew 'libzip'
# brew 'lua-language-server'
## brew 'mas'
## brew 'neovim'
brew 'node'
brew 'npm'
brew 'pipx'
brew 'pmd'
brew 'pyenv'
brew 'readline'
brew 'ripgrep'
brew 'rust'
# brew 'skhd'
brew 'stow'
brew 'tmux'
brew 'tpm'
brew 'tree'
brew 'watch'
# brew 'yabai'
brew 'yarn'
brew 'zig'

# More Stuff
## cask 'aerial'
cask 'alfred'
## cask 'brave-browser'
## cask 'discord'
cask 'docker'
## cask 'homebrew/cask/dash'
cask 'figma'
cask 'flameshot'
## cask 'gimp'
## cask 'google-drive-file-stream'
## cask 'inkscape'
## cast
## 'iterm2'
## cask 'logitech-g-hub'
cask 'microsoft-teams'
cask 'openrefine'
cask 'postman'
## cask 'qlcolorcode'
## cask 'qlimagesize'
## cask 'qlmarkdown'
## cask 'qlprettypatch'
## cask 'qlstephen'
## cask 'qlvideo'
## cask 'quicklook-csv'
## cask 'quicklook-json'
## cask 'quicklookase'
cask 'sf'
## cask 'slack'
## cask 'soapui'
cask 'sourcetree'
cask 'spotify'
cask 'visual-studio-code'
## cask 'webpquicklook'

# Mac App Store items
## mas 'RadarScope', id: 432027450
# mas 'LastPass', id: 926036361
